#Спортсмен-лыжник начал тренировки, пробежав в первый день 10 км. Каждый следующий день он увеличивал длину пробега на Р процентов от пробега предыдущего дня (P — вещественное, 0< Р <50). По данному Р определить, после какого дня суммарный пробег лыжника за все дни превысит 200 км, и вывести найденное количество дней К (целое) и суммарный пробег S (вещественное число).

while True:
    try:
        p = int(input("Введите процент увеличения пробега: "))
        if 0 < p <= 50:
            break
        else:
            print("Процент должен быть в диапазоне от 0 до 50.")
    except ValueError:
        print("Введите правильное число.")

distance = 10
days = 1

while distance <= 200:
    distance += distance * (p / 100)
    days += 1

print("Количество дней:", days)
print("Суммарный пробег:", distance)