#Даны три целых числа: А, В, С. Проверить истинность высказывания: «Число В находится между числами А и С».
while True:
    try:
        a = int(input("Введите число A: "))
        b = int(input("Введите число B: "))
        c = int(input("Введите число C: "))        
        break
    except ValueError:
        print("Ошибка: введите целые числа")

if (a < b < c) or (c < b < a):
    print("Число", b, "находится между числами", a, "и", c)
else:
    print("Число", b, "не находится между числами", a, "и", c)